app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find(session[:user_id]) if session[:user_id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1