app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`user_name` IS NULL LIMIT 1
---
  def create
    session_params = params.permit(:user_name, :password)
    @user = User.find_by(user_name: session_params[:user_name])