app/controllers/user_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO `users` (`email`, `first_name`, `last_name`, `user_name`, `password_digest`, `created_at`, `updated_at`) VALUES ('ok', 'ok', 'ok', 'oko', '$2a$12$8YwsinlC.ishhUuYftMfp.yNqJB/jyQ2QgQvFSzxSZzbJjrj3eDKm', '2021-09-11 10:13:50.767839', '2021-09-11 10:13:50.767839')